In [9]:
import pandas as pd

data = { 'Name': ['Yashwanth Kumar','Raviteja Beri', 'Rahul Reddy'],
         'Date': ['2000-09-06','2002-11-19','2002-02-02'],
         'Address': ['Hyderabad, Telangana','EastGodavari,  Ap','Guntur, Ap'],
         'Time': ['08:30:12','10:45:16','3:15:08'] }

df=pd.DataFrame(data)

In [11]:
df

              Name        Date               Address      Time
0  Yashwanth Kumar  2000-09-06  Hyderabad, Telangana  08:30:12
1    Raviteja Beri  2002-11-19     EastGodavari,  Ap  10:45:16
2      Rahul Reddy  2002-02-02            Guntur, Ap   3:15:08

In [2]:
df[['first_name','last_name']]=df['Name'].str.split(' ', n=1, expand=True)
df[['city','state']]=df['Address'].str.split(' ', n=1, expand=True)
df['Date']=pd.to_datetime(df['Date'])
df['Year']=df['Date'].dt.year
df['Month']=df['Date'].dt.month
df['Day']=df['Date'].dt.day

df[['Hour','Minute','Seconds']]=df['Time'].str.split(':', expand=True)

print(df)

              Name       Date               Address      Time first_name  \
0  Yashwanth Kumar 2000-09-06  Hyderabad, Telangana  08:30:12  Yashwanth
1    Raviteja Beri 2002-11-19     EastGodavari,  Ap  10:45:16   Raviteja
2      Rahul Reddy 2002-02-02            Guntur, Ap   3:15:08      Rahul

  last_name           city      state  Year  Month  Day Hour Minute Seconds
0     Kumar     Hyderabad,  Telangana  2000      9    6   08     30      12
1      Beri  EastGodavari,         Ap  2002     11   19   10     45      16
2     Reddy        Guntur,         Ap  2002      2    2    3     15      08

In [3]:
new_df=['first_name','last_name','Date','Year','Month','Day','Hour','Minute','Seconds']
df=df[new_df]

print(df)

  first_name last_name       Date  Year  Month  Day Hour Minute Seconds
0  Yashwanth     Kumar 2000-09-06  2000      9    6   08     30      12
1   Raviteja      Beri 2002-11-19  2002     11   19   10     45      16
2      Rahul     Reddy 2002-02-02  2002      2    2    3     15      08